# 1st program
print(9**0.5 * 5)
#возводим в степень далее умножаем на 5


#2nd program
print(9.99 > 9.98 and 1000 != 1000.1)
# and позволяет показать True или False только если оба варианта верны/неверны


# 3rd program
print(2 * 2 + 2)
print(2 * (2 + 2))
print((2 * 2 + 2) == (2 * (2 + 2)))
#последовательное умножение , далее скобками выставляем приоритет сложению, == сравнивает два выражения


# 4th program
print (int(float("123.456") * 10 ) % 10)
# Преобразовываем str во float и * на 10 для смещения запятой, затем float присваем int и далее выводим ответ на экран
#  при помощи деления на 10 с остатком.